ben_muller/week5/mountain_app/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.create mountain_params
---
INSERT INTO "mountains" ("name", "country", "altitude", "image") VALUES (?, ?, ?, ?)  [["name", "Everest"], ["country", "Nepal"], ["altitude", 8848], ["image", "https://www.topchinatravel.com/template/images/mount-everest/mount-everest-facts.jpg"]]

  def update
    mountain = Mountain.find params[:id]
    mountain.update mountain_params
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "mountains" SET "name" = ? WHERE "mountains"."id" = ?  [["name", "Everest22"], ["id", 2]]

  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 2]]